@echo off

REM Встановлення шляху для збереження звіту
set "report_path=C:\Projects UNI\lab3\Labs\PZ-23-2\Petryha Alina Oleksandrivna\Report.txt"

REM Вміст звіту
set "report_content= Вступ: У даній роботі було вивчено та застосовано основні команди пакетних файлів для автоматизації деяких операцій у операційній системі Windows. Мета: Основною метою роботи було ознайомлення з можливостями пакетних файлів та їх використання для створення папок, копіювання файлів, а також зміни атрибутів файлів та папок. Методи: Для досягнення поставленої мети були використані такі команди пакетних файлів: mkdir: для створення нових папок. attrib: для зміни атрибутів файлів та папок. xcopy: для копіювання файлів. Опис виконаних дій: Спочатку було створено основну папку batch за допомогою команди mkdir. Потім в цій папці були створені дві підпапки: Hidden folder та Not hidden folder. Використовуючи команду attrib, було змінено атрибути однієї з підпапок на приховану. Копіювання файлу copyhelp.txt було виконано за допомогою команди xcopy з папки Not hidden folder до папки Hidden folder."

REM Запис вмісту звіту у файл
echo %report_content% > "%report_path%"

REM Повідомлення про успішне створення звіту
echo The report was successfully created in the path: %report_path%
